# Final Assignment

### The Set of Data
1. **Chicago Socioeconomic Indicators**
    This dataset contains a selection of six socioeconomic indicators of public health significance and a hardship index, by Chicago community area, for the years 2008 â€“ 2012.

2. **Chicago Public Schools**
    This dataset shows all school level performance data used to create CPS School Report Cards for the 2011-2012 school year.

3. **Chicago Crime Data**
    This dataset reflects reported incidents of crime (with the exception of murders where data exists for each victim) that occurred in the City of Chicago from 2001 to present, minus the most recent seven days.

### Instructions
1. **Review the datasets**
2. **Load the datasets into a database**

    Perform this step using the LOAD tool in the Db2 console. You will need to create 3 tables in the database, one for each dataset, named as follows, and then load the respective .CSV file into the table:

        CENSUS_DATA

        CHICAGO_PUBLIC_SCHOOLS

        CHICAGO_CRIME_DATA


3. **Write and execute queries**

    Perform this step in the Jupyter notebook provided in the previous section. Carefully read and understand each problem. Compose and execute the appropriate SQL queries to answer each of the problems. Take a screenshot of each query and its results and save it as a jpg file..

In [1]:
# Enter the connection string for your Db2 on Cloud database instance below
%load_ext sql
%sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name?security=SSL

In [2]:
%sql select TABSCHEMA, TABNAME, CREATE_TIME from syscat.tables where tabschema='WTW06347'

 * ibm_db_sa://wtw06347:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('WTW06347', 'CHICAGO_PUBLIC_SCHOOL', datetime.datetime(2022, 7, 12, 20, 8, 16, 510139)),
 ('WTW06347', 'PETSALE', datetime.datetime(2022, 5, 5, 21, 50, 28, 542717)),
 ('WTW06347', 'EMPLOYEES', datetime.datetime(2022, 5, 7, 17, 15, 53, 974364)),
 ('WTW06347', 'JOB_HISTORY', datetime.datetime(2022, 5, 7, 17, 15, 54, 63035)),
 ('WTW06347', 'JOBS', datetime.datetime(2022, 5, 7, 17, 15, 54, 154876)),
 ('WTW06347', 'DEPARTMENTS', datetime.datetime(2022, 5, 7, 17, 15, 54, 248938)),
 ('WTW06347', 'LOCATIONS', datetime.datetime(2022, 5, 7, 17, 15, 54, 338633)),
 ('WTW06347', 'PETRESCUE', datetime.datetime(2022, 5, 8, 0, 30, 31, 21926)),
 ('WTW06347', 'CHICAGO_PUBLIC_SCHOOLS', datetime.datetime(2022, 7, 17, 3, 30, 28, 413513)),
 ('WTW06347', 'CENSUS_DATA', datetime.datetime(2022, 7, 17, 3, 32, 12, 112837)),
 ('WTW06347', 'CHICAGO_CRIME_DATE', datetime.datetime(2022, 7, 17, 3, 35, 18, 201993)),
 ('WTW06347', 'INSTRUCTOR', datetime.datetime(2022, 6, 7, 3, 58, 40, 301733)),
 ('WTW06347', 'INTERNATIONAL_STUDENT_TEST_SCORES', datetime.datetime(2022, 6, 7, 15, 39, 2, 811709)),
 ('WTW06347', 'CHICAGO_SOCIOECONOMIC_DATA', datetime.datetime(2022, 6, 10, 20, 14, 28, 256401))]

In [3]:
%sql select colname, typename, length from syscat.columns where tabname='CHICAGO_CRIME_DATE'

 * ibm_db_sa://wtw06347:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('ID', 'INTEGER', 4),
 ('CASE_NUMBER', 'VARCHAR', 8),
 ('DATE', 'DATE', 4),
 ('BLOCK', 'VARCHAR', 35),
 ('IUCR', 'VARCHAR', 4),
 ('PRIMARY_TYPE', 'VARCHAR', 15),
 ('DESCRIPTION', 'VARCHAR', 46),
 ('LOCATION_DESCRIPTION', 'VARCHAR', 33),
 ('ARREST', 'VARCHAR', 5),
 ('DOMESTIC', 'VARCHAR', 5),
 ('BEAT', 'SMALLINT', 2),
 ('DISTRICT', 'SMALLINT', 2),
 ('WARD', 'SMALLINT', 2),
 ('COMMUNITY_AREA_NUMBER', 'SMALLINT', 2),
 ('FBICODE', 'VARCHAR', 3),
 ('X_COORDINATE', 'INTEGER', 4),
 ('Y_COORDINATE', 'INTEGER', 4),
 ('YEAR', 'SMALLINT', 2),
 ('LATITUDE', 'DECIMAL', 18),
 ('LONGITUDE', 'DECIMAL', 18),
 ('LOCATION', 'VARCHAR', 29)]

Problem 1: Find the total number of crimes recorded in the CRIME table.

In [87]:
%sql select count(CASE_NUMBER) as TOTAL_NUMBER_CRIMES from CHICAGO_CRIME_DATA

 * ibm_db_sa://wtw06347:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[(533,)]

Problem 2: List community areas with per capita income less than 11000.

In [76]:
%sql select COMMUNITY_AREA_NUMBER, COMMUNITY_AREA_NAME, PER_CAPITA_INCOME\
    from CENSUS_DATA\
        where PER_CAPITA_INCOME<11000

 * ibm_db_sa://wtw06347:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[(26, 'West Garfield Park', 10934),
 (30, 'South Lawndale', 10402),
 (37, 'Fuller Park', 10432),
 (54, 'Riverdale', 8201)]

Problem 3: List all case numbers for crimes involving minors?

In [77]:
%sql select case_number \
    from CHICAGO_CRIME_DATA \
        where DESCRIPTION like '%MINOR%';

 * ibm_db_sa://wtw06347:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('HL266884',), ('HK238408',)]

Problem 4: List all kidnapping crimes involving a child?(children are not considered minors for the purposes of crime analysis)

In [78]:
%sql select * \
    FROM CHICAGO_CRIME_DATA\
         WHERE PRIMARY_TYPE LIKE '%KIDNAP%' and DESCRIPTION LIKE '%CHILD%'

 * ibm_db_sa://wtw06347:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[(5276766, 'HN144152', datetime.date(2007, 1, 26), '050XX W VAN BUREN ST', '1792', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER', 'STREET', 'FALSE', 'FALSE', 1533, 15, 29, 25, '20', 1143050, 1897546, 2007, Decimal('41.87490841'), Decimal('-87.75024931'), '(41.874908413, -87.750249307)')]

Problem 5: What kind of crimes were recorded at schools?

In [79]:
%sql select PRIMARY_TyPE \
    from CHICAGO_CRIME_DATA\
         WHERE LOCATION_DESCRIPTION LIKE '%SCHOOL%'\
             GROUP BY PRIMARY_TyPE

 * ibm_db_sa://wtw06347:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('ASSAULT',),
 ('BATTERY',),
 ('CRIMINAL DAMAGE',),
 ('CRIMINAL TRESPA',),
 ('NARCOTICS',),
 ('PUBLIC PEACE VI',)]

Problem 6: List the average safety score for all types of schools.

In [80]:
%sql select "\"Elementary, Middle, or High School\"", AVG(SAFETY_SCORE) as AVERAGE_SCORE_PER_TYPE_SCHOOL\
     from CHICAGO_PUBLIC_SCHOOLS\
         GROUP BY "\"Elementary, Middle, or High School\""

 * ibm_db_sa://wtw06347:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('ES', 49), ('HS', 49), ('MS', 48)]

Problem 7: List 5 community areas with highest % of households below poverty line.

In [81]:
%sql select COMMUNITY_AREA_NAME, PERCENT_HOUSEHOLDS_BELOW_POVERTY\
     from CENSUS_DATA\
         ORDER BY PERCENT_HOUSEHOLDS_BELOW_POVERTY DESC\
             LIMIT 5

 * ibm_db_sa://wtw06347:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('Riverdale', Decimal('56.5')),
 ('Fuller Park', Decimal('51.2')),
 ('Englewood', Decimal('46.6')),
 ('North Lawndale', Decimal('43.1')),
 ('East Garfield Park', Decimal('42.4'))]

 Problem 8: Which community area(number) is most crime prone?

In [83]:
%sql select COMMUNITY_AREA_NUMBER, count(*) as FRECUENCY\
     from CHICAGO_CRIME_DATA \
        group by COMMUNITY_AREA_NUMBER\
            order by FRECUENCY DESC\
                fetch first 1 rows only

 * ibm_db_sa://wtw06347:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[(25, 43)]

 Problem 9: Use a sub-query to find the name of the community area with highest hardship index.

In [84]:
%sql select COMMUNITY_AREA_NAME\
     from CENSUS_DATA\
         where HARDSHIP_INDEX=(select MAX(HARDSHIP_INDEX) from CENSUS_DATA)

 * ibm_db_sa://wtw06347:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('Riverdale',)]

Problem 10: Use a sub-query to determine the Community Area Name with most number of crimes?

In [86]:
%%sql 
SELECT COMMUNITY_AREA_NAME
 FROM CENSUS_DATA
  WHERE COMMUNITY_AREA_NUMBER IN (SELECT COMMUNITY_AREA_NUMBER
     FROM CHICAGO_CRIME_DATA
       GROUP BY COMMUNITY_AREA_NUMBER
         ORDER BY count(*) DESC LIMIT 1)

 * ibm_db_sa://wtw06347:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('Austin',)]